{
  "card": {
    "thumbnail": "../../assets/images/cs-kaelis/kaelis-thumbnail.webp",
    "title": "Kælis The Crypto Ring",
    "description": "Screenless wearable enabling secure, offline crypto payments through gestures.",
    "date": "",
    "tag": [""],
    "featured": true,
    "priority": 4
  },
  "case": {
    "title": "A Tap Away from Freedom: The Design Behind Kælis",
    "summary": "Kaelis is a discreet wearable that enables secure, offline crypto payments and decentralised identity through simple gestures. As Product Owner, I led the full project from research to functional prototyping bridging UX, hardware, and Web3 logic. The goal was to make cold-wallet-grade security accessible and stress-proof, even under pressure or without connectivity.",
    "meta": [
      { "label": "Role", "value": "Project Owner" },
      { "label": "Duration", "value": "34 Weeks" },
      { "label": "Domain", "value": "Web3 + IoT" }
    ],

    "context": {
      "items": [
        {
          "src": "../../assets/images/cs-kaelis/kaelis-thumbnail.webp",
          "alt": "Kaelis thumbnail",
          "caption": "Core app screens for setup, recovery, and state feedback-clarity without crypto jargon."
        }
      ],
      "title": "Context",
      "content": [
        {
          "text": "The project began as an independent exploration of Web3 and IoT convergence, addressing the growing need for privacy-preserving payment devices that function without network reliance. Most crypto wallets depend on screens, seed phrases, and cloud backups processes that alienate mainstream users and fail in low-connectivity or coercive contexts."
        },
        {
          "text": "As a solo designer, I led research, product strategy, and prototyping, collaborating with crypto and hardware engineers for technical validation. The challenge was to design a screenless, gesture-driven payment device that remains secure, comprehensible, and recoverable, even offline."
        }
      ]
    },

    "process": {
      "title": "Process",
      "content": [
        {
          "subtitle": "Research & Insight",
          "text": "I interviewed 15 users across three archetypes: crypto-natives, sovereignty-driven users, and cautious newcomers, to uncover trust triggers and threat models. Findings revealed that users trust physical control and simplicity over transparency or complexity. These insights defined how every interaction would feel and respond."
        },
        {
          "subtitle": "Ideation & Prototyping",
          "text": "I translated behavioural insights into a finite-state model defining how gestures (tap, triple tap, long press, custom sequence) map to system states like “Paired”, “Ghost Mode”, or “Wiped”. Rapid prototyping with Arduino Nano, capacitive sensors, and 3D-printed rings allowed real-world testing of gesture reliability and haptic feedback under stress."
        },
        {
          "subtitle": "Interface & Systems Design",
          "text": "I built a companion app focused on setup, recovery, and transparency. No seed phrases, no blockchain jargon. The design system prioritised clarity under stress: high contrast, explicit state feedback, and friction where safety mattered. This work bridged physical and digital experiences into a single, resilient ecosystem."
        }
      ]
    },

    "media": {
      "title": "",
      "items": [
        {
          "src": "../../assets/images/cs-kaelis/kaelis-screens.webp",
          "alt": "Kaelis dashboard overview",
          "caption": "Core app screens for setup, recovery, and state feedback-clarity without crypto jargon."
        },
        {
          "src": "../../assets/images/cs-kaelis/kaelis-ring.webp",
          "alt": "Kaelis ring technology",
          "caption": "Kaelis ring with Secure Element, NFC, and touch sensors for offline gesture control."
        },
        {
          "src": "../../assets/images/cs-kaelis/kaelis-dashboard.webp",
          "alt": "Kaelis ring pairing",
          "caption": "Seedless onboarding through secure ring pairing-simple, clear, and stress-free."
        }
      ]
    },

    "outcome": {
      "title": "Outcomes",
      "content": {
        "text": "Kaelis emerged as a validated proof-of-concept combining cold-wallet security with human-centred UX. The wearable and companion app operated entirely offline, with delegated signing, seedless onboarding, and gesture-based state control. Testing proved that people could trust and understand crypto interactions without screens or biometrics."
      },
      "kpi": {
        "items": [
          {
            "number": "63%",
            "text": "Reduction in cognitive load during stress scenarios."
          },
          {
            "number": "45%",
            "text": "Faster task completion compared to standard wallets"
          },
          {
            "number": "100%",
            "text": "Flow success rate achieved after one guided walkthrough"
          }
        ]
      }
    }
  },
  "full-case": {}
}
