{
  "card": {
    "thumbnail": "../../assets/images/cs-talers/talers-thumbnail.webp",
    "title": "Talers The Writing App",
    "description": "Platform centralising drafting, notes, and publishing into one unified writing experience.",
    "date": "",
    "tag": [""],
    "featured": true,
    "priority": 2
  },

  "case": {
    "title": "Where Stories Take Wing: The Making of Talers",
    "summary": "Talers is a SaaS platform created to simplify the writing journey. Writers were struggling with fragmented workflows across multiple tools, causing loss of focus and inefficiency. As Lead Designer, I defined the product vision, led research, and designed the MVP. The outcome was a scalable design system and an intuitive interface that validated strong market demand.",
    "meta": [
      { "label": "Role", "value": "Lead Designer" },
      { "label": "Duration", "value": "38 Weeks" },
      { "label": "Domain", "value": "SaaS" }
    ],

    "context": {
      "title": "Context",
      "text": "Talers was incubated at 1Kubator with the mission to simplify the writing journey. At the time, the market was saturated with fragmented tools from basic word processors to heavy publishing software but none offered a seamless, end-to-end experience. Talers set out to close this gap with an accessible, all-in-one platform."
    },

    "problems": {
      "title": "Problems",
      "text": "Writers relied on fragmented workflows, switching between 3-5 tools daily for drafting, notes, and progress tracking. This caused lost focus, poor organisation, and inconsistent productivity. From a business perspective, this fragmentation highlighted a clear opportunity: build a tool that centralises essential functions without the steep learning curve of professional software."
    },

    "approach": {
      "title": "Approach",
      "text": "I led the design process end-to-end. Research included user interviews, surveys, and competitor analysis to validate key pain points. We held co-creation workshops with early adopters to explore concepts and prioritise features. I created personas, journey maps, and flows to frame decisions, and iterated through sketches, wireframes, and prototypes. My responsibilities covered brand identity, UI system design, and technical collaboration with the founder, who built the full-stack MVP."
    },

    "solution": {
      "title": "Solution",
      "text": "The result was Talers: a distraction-free writing platform that centralises drafting, notes, progress tracking, and export-ready publishing. The design system established consistent components and scalable patterns, reducing complexity for future development. Visual identity combined clarity with creativity — a book–butterfly logo symbolising transformation. The MVP focused on simplicity, ensuring writers could move from blank page to organised manuscript with minimal friction."
    },

    "media": {
      "title": "",
      "items": [
        {
          "src": "../../assets/images/cs-talers/talers-file.webp",
          "alt": "Talers dashboard overview",
          "caption": "Progress tracking and goal reminders help sustain a daily writing habit."
        },
        {
          "src": "../../assets/images/cs-talers/talers-detail.webp",
          "alt": "Talers mobile writing flow",
          "caption": "Adaptive layouts keep the writing experience consistent on the go."
        },
        {
          "src": "../../assets/images/cs-talers/talers-dashboard.webp",
          "alt": "Talers progress tracking view",
          "caption": "Homepage consolidates drafts, notes and publishing tools."
        }
      ]
    },

    "impact": {
      "title": "Result",
      "text": "",
      "kpi": {
        "items": [
          { "number": "92%", "text": "task completion during usability tests" },
          { "number": "37%", "text": "faster setup for new writing projects" },
          { "number": "+42", "text": "Net Promoter Score from early adopters" }
        ]
      }
    },

    "quote": {
      "text": "Collaborating on Talers was seamless. The design process balanced speed with rigor, and the outcome exceeded expectations—clean UX, clear priorities, and a product our early writers loved.",
      "author": "Matthieu Gindre",
      "role": "Founder",
      "company": "Talers",
      "avatar": "/src/assets/images/avatars/matthieu-gindre.png",
      "avatarW": 44,
      "avatarH": 44
    }
  },
  "full-case": {}
}
