{
  "card": {
    "thumbnail": "../../assets/images/cs-talers/talers-thumbnail.webp",
    "thumbnailWidth": 1200,
    "thumbnailHeight": 900,
    "title": "Talers The Writing App",
    "description": "Platform centralising drafting, notes, and publishing into one unified writing experience.",
    "date": "",
    "tag": [""],
    "featured": true,
    "priority": 2
  },

  "case": {
    "title": "Where Stories Take Wing: The Making of Talers",
    "summary": "Talers is a SaaS writing platform that centralises drafting, note-taking, and publishing into one seamless environment. As Lead Designer, I shaped the product vision and led the design process, from research and ideation to delivery. The goal was to simplify fragmented writing workflows and help authors stay focused, organised, and creatively in control throughout their writing journey.",
    "meta": [
      { "label": "Role", "value": "Lead Designer" },
      { "label": "Duration", "value": "38 Weeks" },
      { "label": "Domain", "value": "SaaS" }
    ],

    "context": {
      "title": "Context",
      "content": [
        {
          "text": "The project began within 1Kubator, where the founder had identified a clear gap in the writing market. Existing tools forced authors to juggle several disconnected apps from note-taking and drafting to editing and progress tracking, creating friction and loss of focus. Talers was conceived as an accessible, all-in-one writing platform that simplifies this fragmented experience."
        },
        {
          "text": "My role covered the full design spectrum, from discovery to delivery. I led design strategy, and brand development, while maintaining close collaboration with the founder, who handled full-stack development. The challenge was to create a platform intuitive enough for new writers yet powerful enough to support long-form, structured writing. The core problem was clear: writers were losing creative flow to disorganisation and tool overload."
        }
      ]
    },

    "process": {
      "title": "Process",
      "content": [
        {
          "subtitle": "Research & Insight",
          "text": "I began with qualitative interviews and competitor analysis to identify writers' habits, pain points, and tool dependencies. Insights revealed that 76% of users relied on at least three different apps daily, and 68% lost focus when switching contexts. These findings informed the product's central goal: unifying the writing workflow into one frictionless environment."
        },
        {
          "subtitle": "Ideation & Prototyping",
          "text": "Through collaborative workshops with the founder and early users, we defined the core feature set: distraction-free writing, integrated notes, goal tracking, and easy exporting. I translated research insights into user journeys, wireframes, and high-fidelity prototypes. Each iteration was validated through usability testing, ensuring clarity and flow. I also designed the brand identity, a fusion of a book and butterfly, representing both structure and creativity."
        },
        {
          "subtitle": "Interface & Systems Design",
          "text": "I developed a scalable design system with reusable components, grid structures, and interaction patterns to streamline front-end implementation. Regular design-to-development syncs ensured that visual intent and technical feasibility aligned throughout. This close collaboration reduced handoff friction and accelerated build time for the MVP."
        }
      ]
    },

    "media": {
      "title": "",
      "items": [
        {
          "src": "../../assets/images/cs-talers/talers-file.webp",
          "alt": "Talers dashboard overview",
          "caption": "Progress tracking and goal reminders help sustain a daily writing habit.",
          "width": 1600,
          "height": 1212
        },
        {
          "src": "../../assets/images/cs-talers/talers-detail.webp",
          "alt": "Talers mobile writing flow",
          "caption": "Adaptive layouts keep the writing experience consistent on the go.",
          "width": 1600,
          "height": 1200
        },
        {
          "src": "../../assets/images/cs-talers/talers-system.webp",
          "alt": "Talers system design",
          "caption": "A unified component library keeps writing tools clear and cohesive.",
          "width": 1200,
          "height": 900
        }
      ]
    },

    "outcome": {
      "title": "Outcomes",
      "content": [
        {
          "text": "The final product, Talers, offers a clean, distraction-free interface that lets writers move seamlessly from ideas to publication. It integrates notes, progress tracking, and export tools in a way that keeps creativity central while reducing cognitive load."
        },
        {
          "text": "User testing and post-launch feedback confirmed strong adoption and satisfaction. The MVP validated the market need for a unified writing solution and positioned Talers as a promising entrant in the SaaS ContentTech landscape."
        }
      ],
      "kpi": {
        "items": [
          { "number": "92%", "text": "Task completion during usability tests" },
          { "number": "37%", "text": "Faster setup for new writing projects" },
          { "number": "+42", "text": "Net Promoter Score from early adopters" }
        ]
      }
    },

    "quote": {
      "text": "Collaborating on Talers was seamless. The design process balanced speed with rigor, and the outcome exceeded expectations—clean UX, clear priorities, and a product our early writers loved.",
      "author": "Matthieu Gindre",
      "role": "Founder",
      "company": "Talers",
      "avatar": "/src/assets/images/avatars/matthieu-gindre.png",
      "avatarW": 44,
      "avatarH": 44
    }
  },
  "full-case": {}
}
