{
  "card": {
    "thumbnail": "../assets/images/profile/R.png",
    "title": "Talers The Writing App",
    "description": "Platform centralising drafting, notes, and publishing into one unified writing experience.",
    "date": "",
    "tag": [""],
    "featured": true,
    "priority": 2
  },
  "case": {
    "title": "Where Stories Take Wing: The Making of Talers",
    "summary": "Talers is a SaaS writing platform designed to simplify and centralise the creative process for authors. Writers often lose time juggling multiple tools for drafting, notes, and organisation. Over 38 weeks, I led the product design from research to delivery of an MVP, working closely with the founder to define priorities and ensure technical feasibility. The result was a unified writing app that improved user productivity, engagement, and confidence.",
    "meta": [
      { "label": "Role", "value": "Lead Designer" },
      { "label": "Duration", "value": "38 Weeks" },
      { "label": "Domain", "value": "SaaS" }
    ],

    "context": {
      "title": "The Landscape: ContentTech in Transition",
      "text": "Talers is a startup incubated at 1Kubator, founded to serve the growing ContentTech market. The product aimed to provide writers with a single, accessible platform to draft, organise, and prepare their work for publication. The team consisted of the founder as full-stack engineer, a product manager and myself as lead product designer.",
      "image": {
        "src": "",
        "alt": "Talers interface overview",
        "caption": "App overview"
      }
    },
    "problems": {
      "title": "Problems",
      "text": "Writers relied on fragmented workflows, often using three or more separate apps for drafting, editing, and note-taking. This created friction, distraction, and a loss of momentum. From a business perspective, this also left space for a differentiated solution: an all-in-one writing platform that could offer both usability and focus."
    },
    "approach": {
      "title": "Approach",
      "text": "I ran user interviews, competitor teardowns, and ideation workshops with the founder and early testers to identify core needs. We prioritised features using value-vs-effort trade-offs, focusing on writing flows, notes, and progress tracking. I designed wireframes, user flows, and high-fidelity prototypes, then created a design system to support the founder’s development."
    },
    "solution": {
      "title": "Solution",
      "text": "The MVP launched with a clean, distraction-free writing interface, integrated notes, project organisation tools, and progress tracking. Export options were included to support professional workflows. The design balanced creativity with structure, allowing writers to focus on content while staying in control of their projects."
    },
    "impact": {
      "title": "Impact",
      "text": "Usability testing showed a 92% task completion rate, with project setup time reduced by 37%. Early adopters reported a 45% increase in writing consistency, and the platform achieved a 4.6/5 satisfaction rating. These results validated the product vision and positioned Talers as a promising SaaS + ContentTech solution, designed by writers for writers."
    },
    "quote": {
      "text": "Collaborating on Talers was seamless. The design process balanced speed with rigor, and the outcome exceeded expectations—clean UX, clear priorities, and a product our early writers loved.",
      "author": "Matthieu Gindre",
      "role": "Founder",
      "company": "Talers",
      "avatar": "/src/assets/images/avatars/matthieu-gindre.png",
      "avatarW": 44,
      "avatarH": 44
    }
  },
  "full-case": {
    "title": ""
  }
}
